package Java.a02_basic;

/*
 	#Java 작성 방법
  1. 최상단에 소속되어 있는 package 단위 선언
  2. 사용하게 될 외부패키지의 클래스 선언
  	ex) import @@@.@@@;
  3. class 선언
  	접근제어자 class 클래스명 { 사용할 중괄호 블럭범위 }
  	1) 코드를 작성하고 정리할 때는 반드시 포함되어 있는 계층구조를 명확히 해야함
  		-> 가독성을 위함(코드를 읽고 해석하는 능력이 높아진다)
  		
*/


public class A03_Peeson {

	
	// 하위에 소속된 block(중괄호)는 탭 간격을 통해 적절한 표기 (계층구조) -> 가독성 ↑
	void call() {
		
		// call() 하위의 조건문이므로 탭간격 맞추기
		// 소스코드 자동정리 : ctrl+shift+f, 블럭단위로 소스 자동 정리 처리
		if(true) {
			
		}
		
		for(;;) {
			
		}
		
	}
}
