package Java.a01_exp.month05;

public class A01_p0504 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
1. 새로운 javaexp2 폴더를 만들고 eclipse의 installer 설치한 후
	오늘 설치한 개발환경을 처리하고, hello java를 출력하세요 
2. 자바의 기본 변수 선언과 할당을 통해 아래의 변수를 선언하고 출력하기
	이름, 나이, 취미
3. 변수와 사칙연산자와 나머지 연산을 활용해 아래와 같은 내용을 처리하기
	1) 곰돌이 3마리가 5개씩 빵을 먹은 총 갯수
	2) 20개의 빵을 3마리의 곰돌이가 동일하게 먹은 갯수와 남은 나머지
	3) 총잔액 100000에서 교통비 3000원 2회, 식대 7000원, 간식비 3000원을 뺀 나머지
4. 컴퓨터 가격이 1000000이상이면 고가 그 외는 저가로 처리하기로 했다.
	해당 프로그램을 조건문에 의해 처리하고 출력하기
5. 반복문을 이용해 30~50까지 출력하고, 10부터 discount로 0까지 출력하기
6. 함수로 입금액을 넣었을 때, 콜라 900원의 잔액을 리턴처리하게 선언하고 출력하기
7. 자바의 heap영역과 stack영역에 대해 메모리기준을 기술하기

		 */
	}

}
